MorganHolland-spoofhopper/hw_13_music_app/MMusic_app/app/controllers/reviews_controller.rb

  def create
    @song = Song.find(params[:song_id])
    @review = @song.reviews.create(review_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("reviewer", "body", "song_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["reviewer", "Morgan"], ["body", "test review 1"], ["song_id", 2], ["created_at", "2015-09-21 18:55:54.428879"], ["updated_at", "2015-09-21 18:55:54.428879"]]