MorganHolland-spoofhopper/hw_13_music_app/MMusic_app/app/controllers/songs_controller.rb

  def show
    @song = get_song
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def create
    @song = Song.new(song_params)
    if @song.save
---
INSERT INTO "songs" ("title", "length", "genre", "lyrics", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Crazy in Love"], ["length", "3:00"], ["genre", "p"], ["lyrics", ""], ["created_at", "2015-09-17 17:25:30.546731"], ["updated_at", "2015-09-17 17:25:30.546731"]]

  def update
    @song = get_song
    if @song.update(song_params)
---
UPDATE "songs" SET "length" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["length", "3:11"], ["updated_at", "2015-09-21 04:52:56.955928"], ["id", 3]]

  def destroy
    @song = get_song
    @song.destroy
---
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 1]]