MorganHolland-spoofhopper/hw_13_music_app/MMusic_app/app/views/artists/show.html.erb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  <% @songs.each do |song| %>
    <%= song.title %> | <%= song.length %> | <%= song.genre %> | <%=link_to 'Song Details', song_path(song), class: 'btn btn-success btn-xs' %>