MorganHolland-spoofhopper/hw_13_music_app/music_app2/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "image_url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @artist = Artist.new(artist_params)
    if @artist.save